app/views/admin/saunas/_baseinfo.html.erb

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 33
SELECT COUNT(*) FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 6
---

	<% unless @sauna.sauna_items.empty? %>