app/views/admin/saunas/_comments.erb

<ul class="comment-list">
	<% unless @sauna.sauna_comments.empty? %>
---
SELECT "sauna_comments".* FROM "sauna_comments" WHERE "sauna_comments"."sauna_id" = 25
SELECT COUNT(*) FROM "sauna_comments" WHERE "sauna_comments"."sauna_id" = 25