app/views/admin/saunas/_sauna_items.erb

SELECT COUNT(*) FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 32
---

<% unless @sauna.sauna_items.empty? %>