app/views/admin/saunas/edit.html.erb

SELECT COUNT(*) FROM "sauna_comments" WHERE "sauna_comments"."sauna_id" = 1
---

	<% unless @sauna.sauna_comments.empty? %>