app/controllers/admin/saunas_controller.rb

	def create
		get_all_cities
		get_districts_for_edit_form

		@user = User.find(params[:sauna][:user_id])
		@sauna = @user.saunas.build(params[:sauna])
		@address = Address.new(params[:sauna][:address])

		if @address.save
			if @sauna.save
				@address.sauna_id = @sauna.id
				@address.save

				h = params[:sauna][:sauna_photos_attributes]

				if h != nil
					h.each do |key, value|
						@sauna_photo = SaunaPhoto.new(:photo => h[key][:photo])
						if @sauna_photo.photo_file_size != nil
							@sauna_photo.sauna_id = @sauna.id
							@sauna_photo.description = h[key][:description]
							@sauna_photo.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "addresses" ("building", "city_id", "created_at", "district_id", "sauna_id", "street", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "saunas" ("created_at", "name", "phone_number1", "phone_number2", "phone_number3", "photo_file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "sauna_photos" ("created_at", "description", "photo_file_name", "photo_file_size", "sauna_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def edit
		@sauna = Sauna.find(params[:id])
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "13"]]

	def show
		@sauna = Sauna.find(params[:id])
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "6"]]

	def update
		get_all_cities
		get_districts_for_edit_form

		@sauna = Sauna.find(params[:id])
		@address = @sauna.address

		if @address.update_attributes(params[:sauna][:address])
			if @sauna.update_attributes(params[:sauna])
				h = params[:sauna][:sauna_photos_attributes]

				if h != nil
					h.each do |key, value|
						@sauna_photo = SaunaPhoto.new(:photo => h[key][:photo])
						if @sauna_photo.photo_file_size != nil
							@sauna_photo.sauna_id = @sauna.id
							@sauna_photo.description = h[key][:description]
							@sauna_photo.save
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "saunas" SET "phone_number2" = '343333', "phone_number3" = '222332', "updated_at" = '2012-01-22 12:56:26.982292' WHERE "saunas"."id" = 13
INSERT INTO "sauna_photos" ("created_at", "description", "photo_file_name", "photo_file_size", "sauna_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def index
		@user = current_user

		h = params[:q]
		@q = Sauna.search(h)
		if h != nil
			@saunas = @q.result(:distinct => true)
		else
			@saunas = current_user.saunas.paginate(:page => params[:page], :per_page => 10)
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."user_id" = 2
SELECT COUNT(*) FROM "saunas" WHERE "saunas"."user_id" = 2

	def destroy
		@sauna = Sauna.find(params[:id])
		@user = @sauna.user
		Sauna.find(params[:id]).destroy
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "57"]]
DELETE FROM "saunas" WHERE "saunas"."id" = ?  [["id", 57]]