app/controllers/admin/sauna_comments_controller.rb

SELECT "sauna_comments".* FROM "sauna_comments" WHERE "sauna_comments"."id" = ? LIMIT 1  [["id", "67"]]
DELETE FROM "sauna_comments" WHERE "sauna_comments"."id" = ?  [["id", 67]]
---
	def destroy
		@sauna_comment = SaunaComment.find(params[:id])
		@sauna = @sauna_comment.sauna
		SaunaComment.find(params[:id]).destroy