app/controllers/admin/sauna_items_controller.rb

SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
		@sauna = Sauna.find(params[:id])

SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "22"]]
INSERT INTO "sauna_items" ("capacity", "created_at", "description", "has_audio", "has_bar", "has_billiards", "has_kitchen", "has_restroom", "has_video", "min_duration", "min_price", "name", "sauna_id", "sauna_type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@sauna = Sauna.find(params[:sauna_item][:sauna_id])
		@sauna_item = @sauna.sauna_items.build(params[:sauna_item])
		if @sauna_item.save

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@sauna_item = SaunaItem.find(params[:id])

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sauna_items" SET "capacity" = 233, "min_price" = 340, "min_duration" = 3, "updated_at" = '2012-01-19 11:15:01.771996' WHERE "sauna_items"."id" = 23
---
	def update
		@sauna_item = SaunaItem.find(params[:id])
		@sauna = @sauna_item.sauna
		if @sauna_item.update_attributes(params[:sauna_item])

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."id" = ? LIMIT 1  [["id", "23"]]
DELETE FROM "sauna_items" WHERE "sauna_items"."id" = ?  [["id", 23]]
---
	def destroy
		@sauna_item = SaunaItem.find(params[:id])
		@sauna = @sauna_item.sauna
		SaunaItem.find(params[:id]).destroy