app/controllers/admin/sauna_photos_controller.rb

	def destroy
		@sauna_photo = SaunaPhoto.find(params[:id])
		@sauna = @sauna_photo.sauna
		SaunaPhoto.find(params[:id]).destroy
---
SELECT "sauna_photos".* FROM "sauna_photos" WHERE "sauna_photos"."id" = ? LIMIT 1  [["id", "53"]]
DELETE FROM "sauna_photos" WHERE "sauna_photos"."id" = ?  [["id", 53]]