app/controllers/admin/users_controller.rb

	def show
		@user = User.find(params[:id])
		@current_page_number = params[:page]
		@saunas = @user.saunas.page(params[:page]).per(10)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "saunas".* FROM "saunas" WHERE "saunas"."user_id" = 2
SELECT COUNT(*) FROM "saunas" WHERE "saunas"."user_id" = 1

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?)

	def index
		h = params[:q]
		@q = User.search(h)
---
SELECT "users".* FROM "users"

	def update
		@user = User.find(params[:id])

		# if somebody tries to send incorrect parameters
		if params[:user].has_key?("user_type") && !current_user.super_admin?
			# somebody who is not administrator - kick him!
			@user.errors["user_type"] = t (:access_denied)
			render 'edit'
		else
			# administrator is able to modify user type - continue
			if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "user_type" = 2, "updated_at" = '2012-01-17 17:27:26.208177' WHERE "users"."id" = 17