app/views/sauna_comments/create.js.erb

INSERT INTO "sauna_comments" ("created_at", "description", "sauna_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 17 Jan 2012 11:14:35 UTC +00:00], ["description", " test test"], ["sauna_id", 25], ["updated_at", Tue, 17 Jan 2012 11:14:35 UTC +00:00], ["user_name", "test1"]]
---
$('<li class="round-box"><dl><dt><span class="author"><%= @sauna_comment.user_name %></span> <span class="date"><%= @sauna_comment.created_at %></span></dt><dd><%= @sauna_comment.description %></dd></dl></li>').appendTo($('.comment-list'));