app/controllers/saunas_controller.rb

	def show
		str_id = params[:id]

		if str_id.nonnegative_integer?
			@sauna = Sauna.find(str_id)
		else
			@sauna = Sauna.where("alias = ?", str_id).first		#find by alias
		end

		if @sauna != nil
			@sauna_items = @sauna.sauna_items
			@sauna_comment = SaunaComment.new
			@booking = Booking.new

			@advertisements = Advertisement.where("city_id = ?", @sauna.address.city_id)
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."sauna_id" = 1 LIMIT 1
SELECT "cities".* FROM "cities" WHERE "cities"."id" = 1 LIMIT 1
SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 1