app/controllers/sauna_comments_controller.rb

	def create
		if simple_captcha_valid?
			@sauna = Sauna.find(params[:sauna_comment][:sauna_id])
			@sauna_comment = @sauna.sauna_comments.build(params[:sauna_comment])
			if @sauna_comment.save
---
SELECT "saunas".* FROM "saunas" WHERE "saunas"."id" = ? LIMIT 1  [["id", "25"]]
INSERT INTO "sauna_comments" ("created_at", "description", "sauna_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 17 Jan 2012 11:14:35 UTC +00:00], ["description", " test test"], ["sauna_id", 25], ["updated_at", Tue, 17 Jan 2012 11:14:35 UTC +00:00], ["user_name", "test1"]]