app/controllers/sauna_items_controller.rb

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @sauna_item = SaunaItem.find(params[:id])