app/views/admin/sauna_items/_form.html.erb

SELECT "sauna_types".* FROM "sauna_types"
---
	<dd>
		<%= f.collection_select :sauna_type_id, SaunaType.all, :id, :name, :include_blank => false %>