app/views/admin/sauna_items/new.html.erb

SELECT "sauna_types".* FROM "sauna_types"
---
    <%= f.label t :sauna_type_id %><br />
    <%= f.collection_select :sauna_type_id, SaunaType.all, :id, :name, :include_blank => false %>