app/views/saunas/_baseinfo.html.erb

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 1
SELECT COUNT(*) FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 1
---

	<% unless @sauna.sauna_items.empty? %>