app/views/saunas/_comments.erb

<ul class="comment-list">
	<% unless @sauna.sauna_comments.empty? %>
---
SELECT COUNT(*) FROM "sauna_comments" WHERE "sauna_comments"."sauna_id" = 2