app/views/saunas/_searchform.html.erb

SELECT "sauna_types".* FROM "sauna_types"
---
					<dd class="main-params-type">
						<%= f.collection_select :sauna_items_sauna_type_id_eq, SaunaType.all, :id, :name, :include_blank => true %>

SELECT "districts".* FROM "districts"
---
					<dd class="township">
						<%= f.collection_select :address_district_id_eq, District.all, :id, :name, :include_blank => true %>