app/views/saunas/index.touch.erb

			<label for="q_address_district_id_eq"><%= t(:address_district_id_eq) %></label>
			<%= f.collection_select :address_district_id_eq, District.all, :id, :name, :include_blank => true %>
---
SELECT "districts".* FROM "districts"