app/views/saunas/show.touch.erb

SELECT "sauna_photos".* FROM "sauna_photos" WHERE "sauna_photos"."sauna_id" = 1
---
		  <ul data-role="listview">
			<% @sauna.sauna_photos.each do |sauna_photo| %>

SELECT "sauna_items".* FROM "sauna_items" WHERE "sauna_items"."sauna_id" = 1
---
	</div>
    <% @sauna.sauna_items.each do |sauna_item| %>